# Data Processing Concepts: Tabular Data, Filtering, Sorting

This mini-lecture covers three key concepts in data processing using Python and pandas:

## 1. Tabular Data & CSV Files
- Tabular data is organized in rows and columns, like a spreadsheet.
- Each column has a name (header).
- CSV (Comma-Separated Values) files are a common format for storing tabular data.

### Explore the CSV File as Text
- Open `data.csv` in VS Code to see how tabular data is stored as plain text.
- Notice how each row is a line, and columns are separated by commas.
- Use the Rainbow CSV extension to highlight columns and make the file easier to read. Right-click in the file and look for the Rainbow CSV submenu.

### Download and Open in a Spreadsheet Program
- Download `data.csv` from your Codespace to your local computer:
    - In browser Codespaces, right-click the file and select "Download".
- Open the downloaded file with a spreadsheet program (Excel, Google Sheets, etc.).
- Observe how the data appears in a grid, with columns and rows.

### Take-home Point
`.csv` files are a simple and widely-used format for moving tabular data from one application to another. They can be viewed as plain text or in spreadsheet programs.

Most important for our purposes, then can be easily read by the python interpreter using the pandas library.

In [1]:
# Example: Reading a CSV file with pandas
import pandas as pd
df = pd.read_csv('data.csv')
df

      name  ps1  ps2  ps3
0    Amina   78   95   82
1      Bob   92   70   99
2  Charlie   85   92   60
3    Dawud   92   85   88
4    Ellie   88   90   86

## 2. Filter Operations
- Filtering means selecting a subset of rows based on criteria.
- Example below: Select rows where `score > 90`.

In [2]:
# Filter rows where ps1 > 90
high_scores = df[df['ps1'] > 90]
high_scores

    name  ps1  ps2  ps3
1    Bob   92   70   99
3  Dawud   92   85   88

Use the copilot to write another code cell that filters based on age instead of score.

## 3. Sorting Rows
- Sorting arranges rows by the values in one or more columns.
- Primary sort: by one column; secondary sort: by another if values are equal.
- Example: Sort by `age`, then by `score` descending.

### Sorting
You can sort the data by a single column, for example, by `ps1` score. This arranges the rows in order of the values in that column.

In [3]:
# Sort by ps1 score (descending order)
df.sort_values('ps1', ascending=False)

      name  ps1  ps2  ps3
1      Bob   92   70   99
3    Dawud   92   85   88
4    Ellie   88   90   86
2  Charlie   85   92   60
0    Amina   78   95   82

In [4]:
# Sort by ps1 score (ascending order)
df.sort_values('ps1', ascending=True)

      name  ps1  ps2  ps3
0    Amina   78   95   82
2  Charlie   85   92   60
4    Ellie   88   90   86
1      Bob   92   70   99
3    Dawud   92   85   88

### Primary and Secondary Sort Order
Notice that the ascending and descending orders were not quite the mirror images of each other. The reason is that there was a tie, and it seems to have preserved the original order of those tied rows: Bob before Dawud in both sorts.

You can specify a secondary column to break the tie, instead of leaving it unspecified.
For example, sort by `ps1` (primary) and then by `ps2` (secondary, to break ties):

In [5]:
# Sort by ps1 (primary) and ps2 (secondary)
df.sort_values(['ps1', 'ps2'], ascending=[False, False])

      name  ps1  ps2  ps3
3    Dawud   92   85   88
1      Bob   92   70   99
4    Ellie   88   90   86
2  Charlie   85   92   60
0    Amina   78   95   82

In [6]:
# Sort by ps1 (primary) and ps3 (secondary)
df.sort_values(['ps1', 'ps3'], ascending=[False, False])

      name  ps1  ps2  ps3
1      Bob   92   70   99
3    Dawud   92   85   88
4    Ellie   88   90   86
2  Charlie   85   92   60
0    Amina   78   95   82